# -*- coding: utf-8 -*-

# for문에 다른 for 문을 포함
for a in range(5):              # ***** 모양 5번 반복 출력
    for b in range(5):          # * 모양 5번 반복 출력
        print('*', end='')  
    print()                     # 줄바꿈
print("---------------------------------------------------------------")

# 구구단 출력
for a in range(1, 10):          # 행
    for b in range(1, 10):      # 열
        print('%dx%d=%d ' % (a, b, a*b), end='')
    print()                     # 줄바꿈
print("---------------------------------------------------------------")

# 삼각형 모양 출력
for a in range(5):
    for b in range(0, a+1):
        print('*', end='')
    print()                     # 줄바꿈
print("---------------------------------------------------------------")

# 역삼각형 모양 출력
for a in range(5):
    for b in range(0, 5-a, 1):
        print('*', end='')
    print()                     # 줄바꿈
print("---------------------------------------------------------------")

# 제어변수를 감소하여 출력
for a in range(5, 0, -1):
    for b in range(0, 6-a):
        print('*', end='')
    print()                     # 줄바꿈
print("---------------------------------------------------------------")

# while 문에 다른 while 문을 포함
a = 0
while a < 5:
    b = 0
    while b < 5:
        print('*', end='')
        b += 1
    print()                 # 줄바꿈
    a += 1
print("---------------------------------------------------------------")

# 구구단(실습) : 중첩 for 문과 while 문을 이용하여 구구단 출력
a = 1
while a < 10:
    b = 1
    while b < 10:
        print('%dx%d=%d ' % (a, b, a*b), end='')
        b += 1
    print()                 # 줄바꿈
    a += 1
print("---------------------------------------------------------------")

# 삼각형 출력(실습)
a = 0                       # a = count
while a < 5:        
    a += 1
    b = 0                   # b = star(*)
    while b < a:
        b += 1
        print("*", end='')
    print()                 # 줄바꿈
print("---------------------------------------------------------------")

# 역삼각형 출력(실습)
a = 0                       # a = count
while a < 5:
    a += 1
    b = 5                   # b = star(*)
    while b >= a:
        b -= 1
        print("*", end='')
    print()                 # 줄바꿈
print("---------------------------------------------------------------")
